<a href="https://colab.research.google.com/github/julioreis-dev/tutorial_pandas/blob/main/analise_junho.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import plotly.express as px

In [2]:
df = pd.read_excel('Relatório_CMAR.xlsx', sheet_name='Sheet1')

In [3]:
df.shape

(148, 13)

In [4]:
df.head()

   Equipamento      Embarcação  ... Valor PBLOG $    Total $
0     30107739   AH GIORGIO P.  ...          0.00  920158.32
1     30119211     AH VALLETTA  ...          0.00   57441.78
2     30100300     AMY CHOUEST  ...          0.00  415359.74
3     30079802  ASGAARD SOPHIA  ...     115297.96  444759.16
4     30007526    ASTRO BADEJO  ...          0.00  375622.96

[5 rows x 13 columns]

In [5]:
df.isna().values.any()

False

# **Bruno os dados abaixo você consegue obter as informações de custo por porte de embarcação.**

In [6]:
df_porte = df.groupby('Porte').sum()
# print(df_porte[['Valor Petrobras $']].sum())
# print(df_porte[['Valor PBLOG $']].sum())
print(df_porte[['Total $']].sum())
df_porte[['Total $']]

Total $    75584226.74
dtype: float64

           Total $
Porte
EGP    45886371.96
EMP     5267324.44
EPP    24430530.34

In [7]:
df[df['Regional'] == 'OCE/TMC']

     Equipamento      Embarcação  ... Valor PBLOG $    Total $
133     30122455  VIKING THAUMAS  ...           0.0  445963.18

[1 rows x 13 columns]

In [8]:
df.loc[df.Regional == 'OCE/TMC', 'Regional'] = 'TMC'

In [12]:
df.loc[133]

Equipamento                30122455
Embarcação           VIKING THAUMAS
Classe                  PSV 3000 OL
Porte                           EGP
Regional                        TMC
Regional CMAR          B. Campos ES
Dias Medir                       31
Indisp                        3.022
Medir                        27.978
Centro de Custo          E890TM1Y83
Valor Petrobras $            445963
Valor PBLOG $                     0
Total $                      445963
Name: 133, dtype: object

# **Bruno os dados abaixo você consegue obter as informações de custo por Regional de embarcação**

In [13]:
df_regional = df.groupby('Regional').sum()
print(df_regional[['Total $']].sum())
df_regional[['Total $']]

Total $    75584226.74
dtype: float64

              Total $
Regional
OCE       16438150.57
OLNNE      3642146.41
OPTO       7404972.57
TMC       47572394.96
TMC-BC      526562.23

# **Bruno os dados abaixo você consegue obter as informações de custo por area geográfica.**

In [41]:
df_regcmar = df.groupby('Regional CMAR').sum()
print(df_regcmar[['Total $']].sum())
df_regcmar[['Total $']].sort_values('Total $', ascending=False)

Total $    75584226.74
dtype: float64

                      Total $
Regional CMAR
B. Campos ES      22201585.22
B. Santos         15743323.67
P. Búzios          8574945.76
AGBS               5645080.42
AGBC               4645691.00
TO                 3283978.54
TS                 3158729.45
AGES               2731115.70
LIBRA              1579102.54
AGRNCE             1310588.91
AGSEAL             1284829.91
Área Remota        1265011.68
UN-RNCE            1134482.73
UN-SEAL            1095314.60
LH                  962264.58
AGBS (exclusiva)    820844.63
UN-BA               147337.40

In [15]:
psv3 = ['PSV 3000 GR', 'PSV 3000 HB', 'PSV 3000 OL']
for psv in psv3:
  df.loc[df.Classe == psv, 'Classe'] = 'PSV 3000'

In [16]:
psv4 = ['PSV 4500 FLU', 'PSV 4500 HB', 'PSV 4500 MUF', 'PSV 4500 OL']
for psv in psv4:
  df.loc[df.Classe == psv, 'Classe'] = 'PSV 4500'

In [17]:
df.loc[df.Classe == 'PSV OSRV 750', 'Classe'] = 'PSV 750'

# **Bruno os dados abaixo você consegue obter as informações de custo por classe para que seja montada aquele gráfico de custo por cada mês.**

In [24]:
df_classe= df[['Classe', 'Equipamento', 'Dias Medir', 'Indisp', 'Medir', 'Valor Petrobras $', 'Valor PBLOG $', 'Total $']]
print(df_classe[['Total $']].sum())
df_classe[['Classe', 'Total $']].groupby('Classe').sum().sort_values('Total $', ascending=False)

Total $    75584226.74
dtype: float64

                Total $
Classe
PSV 4500    40013458.34
PSV 750     13836663.30
PSV 3000     5872913.62
AHTS 12000   5005556.74
UT 4000      2936476.81
OSRV 66      2308343.48
LH 2500      2183990.30
PSV 1500     1812774.21
P5           1038173.33
UT 2500       376872.29
UT 750        135122.07
Lagosteira     45587.86
Lancha         12215.33
Utilitário      6079.06

In [ ]:
df.sort_values('Indisp', ascending=False)

     Equipamento      Embarcação  ... Valor PBLOG $    Total $
40      30108949  CAMPOS CARRIER  ...          0.00   78384.89
27      30056368  BRAM BUCCANEER  ...     187125.62  374865.03
119     30082334  STARNAV VOLANS  ...     127535.28  568714.91
60      30107674      COXON TIDE  ...          0.00  367051.68
28      30081782       BRAM BUCK  ...     183850.49  368287.61
..           ...             ...  ...           ...        ...
56      30079954  CMM CONTINUITY  ...          0.00  493692.20
53      30099177     CBO VITÓRIA  ...          0.00  476633.65
52      30041145    CBO PACIFICO  ...          0.00  595607.79
50      30096853     CBO NITERÓI  ...          0.00  353686.02
147     30096449  MARLIM STOLMAN  ...          0.00   16180.50

[148 rows x 13 columns]

**Bruno os dados abaixo você consegue saber quais foram as classes que tiveram mais indices de inoperância. (NOVO)**

In [27]:
df[['Classe', 'Indisp']].groupby('Classe').sum().sort_values('Indisp', ascending=False)

            Indisp
Classe
PSV 4500    96.672
AHTS 12000  21.646
PSV 3000    20.686
P5          13.969
OSRV 66      9.636
UT 2500      9.160
UT 4000      6.842
LH 2500      6.217
PSV 750      5.713
PSV 1500     2.236
Lagosteira   0.000
Lancha       0.000
UT 750       0.000
Utilitário   0.000

**Bruno os dados abaixo você consegue saber quais foram os portes por embarcação que tiveram mais indices de inoperância. (NOVO)**

In [28]:
df[['Porte', 'Indisp']].groupby('Porte').sum().sort_values('Indisp', ascending=False)

        Indisp
Porte
EGP    117.358
EPP     57.181
EMP     18.238

**Bruno os dados abaixo você consegue saber quais foram as regionais que acumularam os maiores indices de inoperância. (NOVO)**

In [29]:
df[['Regional', 'Indisp']].groupby('Regional').sum().sort_values('Indisp', ascending=False)

           Indisp
Regional
TMC       125.448
OPTO       26.455
OLNNE      25.525
OCE        15.349
TMC-BC      0.000

**Bruno os dados abaixo você consegue saber quais foram as areas geográficas que acumularam os maiores indices de inoperância. (NOVO)**

In [ ]:
df_indisp = df.groupby('Regional CMAR').sum()

In [ ]:
df_indisp[['Indisp']].sort_values('Indisp', ascending=False)

                  Indisp
Regional CMAR
B. Santos         65.541
B. Campos ES      34.363
TS                20.386
P. Búzios         17.168
UN-RNCE           13.862
UN-SEAL           11.184
AGBS              11.019
LIBRA              8.376
LH                 3.052
TO                 3.017
AGRNCE             1.914
AGSEAL             1.681
AGBC               0.735
Área Remota        0.479
UN-BA              0.000
AGES               0.000
AGBS (exclusiva)   0.000

# **Bruno, aqui você terá o quantitativo de embarcações de acordo com os demais critérios.**

In [30]:
df.groupby('Regional').size()

Regional
OCE       33
OLNNE     19
OPTO      16
TMC       77
TMC-BC     3
dtype: int64

In [31]:
df.groupby('Regional CMAR').size()

Regional CMAR
AGBC                 8
AGBS                12
AGBS (exclusiva)     2
AGES                 5
AGRNCE               3
AGSEAL               3
B. Campos ES        41
B. Santos           26
LH                   5
LIBRA                3
P. Búzios           10
TO                   4
TS                   7
UN-BA                3
UN-RNCE              8
UN-SEAL              5
Área Remota          3
dtype: int64

In [32]:
df.groupby('Classe').size()

Classe
AHTS 12000     9
LH 2500       13
Lagosteira     2
Lancha         1
OSRV 66        5
P5             6
PSV 1500       3
PSV 3000      12
PSV 4500      53
PSV 750       27
UT 2500        2
UT 4000       12
UT 750         2
Utilitário     1
dtype: int64

In [ ]:
df.groupby(['Regional', 'Indisp']).size()

# **Bruno, aqui você terá a quais as embarcações que tiveram os maiores indices de inoperância de acordo com o porte. Nesse caso "EGP".**

In [37]:
df[(df['Indisp']!=0) & (df['Porte'] == 'EGP')].sort_values('Indisp', ascending=False).head()

     Equipamento      Embarcação  ... Valor PBLOG $    Total $
40      30108949  CAMPOS CARRIER  ...          0.00   78384.89
27      30056368  BRAM BUCCANEER  ...     187125.62  374865.03
119     30082334  STARNAV VOLANS  ...     127535.28  568714.91
28      30081782       BRAM BUCK  ...     183850.49  368287.61
125     30123564       TALHA MAR  ...          0.00  440612.54

[5 rows x 13 columns]

# **Bruno, aqui você terá a quais as embarcações que tiveram os maiores indices de inoperância de acordo com o porte. Nesse caso "EMP".**

In [38]:
df[(df['Indisp']!=0) & (df['Porte'] == 'EMP')].sort_values('Indisp', ascending=False).head()

     Equipamento   Embarcação  ... Valor PBLOG $    Total $
137     30001699     PARNAÍBA  ...          0.00  121334.68
11      30068928  BARU MUCURA  ...     204693.26  267913.69
130     30110165      UP OPAL  ...          0.00  876257.80
19      30096529    BARU VEGA  ...          0.00  278827.01
17      30094960  BARU TAURUS  ...      85276.47  281153.26

[5 rows x 13 columns]

# **Bruno, aqui você terá a quais as embarcações que tiveram os maiores indices de inoperância de acordo com o porte. Nesse caso "EPP".**

In [39]:
df[(df['Indisp']!=0) & (df['Porte'] == 'EPP')].sort_values('Indisp', ascending=False).head()

     Equipamento        Embarcação  ... Valor PBLOG $    Total $
60      30107674        COXON TIDE  ...          0.00  367051.68
55      30082373      CMM CELERITY  ...          0.00  368670.55
66      30101995  GEONÍSIO BARROSO  ...          0.00  465583.39
121     30017853       SURFER 1870  ...          0.00  175285.20
102     30079250   SIEM MARATAÍZES  ...     489191.82  730255.47

[5 rows x 13 columns]

In [ ]:
from google.colab import drive
drive.mount('/drive', force_remount=True)
df.to_csv('/drive/My Drive/Colab Notebooks/relatorio_cmar.csv')

Mounted at /drive